&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
    
    Оповещение = Новый ОписаниеОповещения("ПослеВводаДопРасходы", ЭтотОбъект);
    ПоказатьВводЧисла(Оповещение, , "Введите дополнительные расходы", 15, 2);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДопРасходы(Сумма, Параметры) Экспорт
    Если Сумма <> Неопределено Тогда
        
        Коэффициенты = Новый Массив;
        Для Каждого Элемент Из Объект.Товары Цикл
            Коэффициенты.Добавить(Элемент.Сумма);
        КонецЦикла;
        
        РаспределитьСумму(Коэффициенты, Сумма, 2);
        
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСумму(Коэффициенты, Сумма, Округление = 2)
    
    ОбщийКоэффициент = 0;
    Для Каждого Коэффициент Из Коэффициенты Цикл
        ОбщийКоэффициент = ОбщийКоэффициент + Коэффициент;
    КонецЦикла;
    
    Если ОбщийКоэффициент = 0 Тогда
        Возврат;
    КонецЕсли;
    
    Остаток = Сумма;
    Для Инд = 0 По Коэффициенты.ВГраница() Цикл
        Элемент = Объект.Товары[Инд];
        
        Доля = Коэффициенты[Инд] / ОбщийКоэффициент;
        Элемент.СуммаДопРасходы = Доля * Сумма;
        
        // Округление
        Элемент.СуммаДопРасходы = Окр(Элемент.СуммаДопРасходы, Округление);
        
        Остаток = Остаток - Элемент.СуммаДопРасходы;
    КонецЦикла;
    
    // Коррекция остатка
    Объект.Товары[0].СуммаДопРасходы = Объект.Товары[0].СуммаДопРасходы + Остаток;
    
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	// Обработка изменения СуммаВсего
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
