
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    Ряд = Элемент.Родитель;
    Ряд.Сумма = Ряд.Количество * Ряд.Цена;
    Ряд.СуммаВсего = Ряд.Сумма + Ряд.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    Ряд = Элемент.Родитель;
    Ряд.Сумма = Ряд.Количество * Ряд.Цена;
    Ряд.СуммаВсего = Ряд.Сумма + Ряд.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
    Ряд = Элемент.Родитель;
    Ряд.СуммаВсего = Ряд.Сумма + Ряд.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
    // Обработка изменений СуммаВсего (если требуется)
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
