&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элемент.Товары.Сумма = Элемент.Товары.Количество * Элемент.Товары.Цена;
	Элемент.Товары.СуммаВсего = Элемент.Товары.Сумма + Элемент.Товары.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элемент.Товары.Сумма = Элемент.Товары.Количество * Элемент.Товары.Цена;
	Элемент.Товары.СуммаВсего = Элемент.Товары.Сумма + Элемент.Товары.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
	Элемент.Товары.СуммаВсего = Элемент.Товары.Сумма + Элемент.Товары.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	// Обработка изменения СуммаВсего
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
