
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
    // Используем стандартный диалог ввода числа
    Оповещение = Новый ОписаниеОповещения("ПослеВводаДопРасходов", ЭтотОбъект);
    ПоказатьВводЧисла(Оповещение, , "Введите сумму доп. расходов", 12, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДопРасходов(СуммаДопРасходов, Параметры) Экспорт
    Если СуммаДопРасходов <> Неопределено Тогда
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    Ряд = Элемент.Родитель.ТекущиеДанные;
    Ряд.Сумма = Ряд.Количество * Ряд.Цена;
    Ряд.СуммаВсего = Ряд.Сумма + Ряд.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    Ряд = Элемент.Родитель.ТекущиеДанные;
    Ряд.Сумма = Ряд.Количество * Ряд.Цена;
    Ряд.СуммаВсего = Ряд.Сумма + Ряд.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
    Ряд = Элемент.Родитель.ТекущиеДанные;
    Ряд.СуммаВсего = Ряд.Сумма + Ряд.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
    // Обработка изменений СуммаВсего (если требуется)
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
