&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
	Параметры = Новый ЭлементФормы("ВвестиДопРасходы");
	Параметры.Режим = РежимДиалога.Вопрос;
	Параметры.Текст = "Введите дополнительные расходы";
	Параметры.Заголовок = "Дополнительные расходы";
	
	Результат = Элементы.Форма.ОткрытьДиалог(Параметры);
	Если Результат = Диалог.Да Тогда
		// Обработка согласия пользователя
	Иначе
		// Обработка отказа пользователя
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	// Обработка изменения СуммаВсего
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
