
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
	ПересчитатьСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	// Ничего не делаем, так как это вычисляемое поле
КонецПроцедуры

&НаКлиенте
Функция ПересчитатьСуммыСтроки()
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущаяСтрока;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Количество = СтрокаТабличнойЧасти.Количество;
	Цена = СтрокаТабличнойЧасти.Цена;
	СуммаДопРасходы = СтрокаТабличнойЧасти.СуммаДопРасходы;

	СтрокаТабличнойЧасти.Сумма = Количество * Цена;
	СтрокаТабличнойЧасти.СуммаВсего = СтрокаТабличнойЧасти.Сумма + СуммаДопРасходы;
КонецФункции

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
