
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)

    Оповещение = Новый ОписаниеОповещения("ПослеВводаСуммы", ЭтотОбъект);

    ПоказатьВводЧисла(Оповещение, , "Укажите сумму дополнительных расходов", 15, 2);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммы(Сумма, Параметры) Экспорт
    Если Сумма <> Неопределено Тогда
        // Обработка введенного значения
        Сообщить("Введенная сумма дополнительных расходов: " + Сумма);
        
        //Применить введенное значение к табличной части
        ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
        ТекущаяСтрока.СуммаДопРасходы = Сумма;
        ПересчитатьСуммыСтроки();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
	ПересчитатьСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	// Ничего не делаем, так как это вычисляемое поле
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыСтроки()
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Количество = СтрокаТабличнойЧасти.Количество;
	Цена = СтрокаТабличнойЧасти.Цена;
	СуммаДопРасходы = СтрокаТабличнойЧасти.СуммаДопРасходы;

	СтрокаТабличнойЧасти.Сумма = Количество * Цена;
	СтрокаТабличнойЧасти.СуммаВсего = СтрокаТабличнойЧасти.Сумма + СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
