&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.СуммаВсего = Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	// Обработка изменения СуммаВсего
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
