
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДопРасходы(Команда)
	// Создаем описание оповещения для обработки результата
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДопРасходы", ЭтотОбъект);
	// Показываем диалог ввода значения
	ПоказатьВводЗначения(
		Оповещение,
		, // без начального значения
		"Введите сумму доп. расходов",
		"Число");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаВсего = ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.СуммаВсего = ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДопРасходыПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.СуммаВсего = ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаДопРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДопРасходы(ЗначениеДопРасходы, Параметры) Экспорт
	Если ЗначениеДопРасходы <> Неопределено Тогда
		// Обновляем значение доп. расходов в интерфейсе
		Элементы.ДопРасходы.Значение = ЗначениеДопРасходы;
		// Пересчитываем итоговую сумму
		ПересчитатьИтоговуюСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоговуюСумму() Экспорт
	// Заготовка обработчика для пересчёта итоговой суммы
КонецПроцедуры
